"""
Hello World

Написать программу выводящую "Hello, World!"
"""

print('Hello, world!')
git a