# 5. Уникальные элементы в списке
# Дан список. Выведите те его элементы, которые встречаются в списке только один раз.
# Элементы нужно выводить в том порядке, в котором они встречаются в списке.

task_3_5 = list('Lorem Ipsum is simply dummy text of the printing and typesetting industry.')
print("Entered data:", task_3_5)
print("List of unique elements:", set(task_3_5))