# 3. Даны два списка чисел.
# Посчитайте, сколько различных чисел содержится одновременно
# как в первом списке, так и во втором.

# ------------------------------------------------------------------------------------ #

x = {1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 1}  # input
y = {1, 700, 900, 5, 7, 100, 150, 1000000, 700}  # input
print("x: ", x)
print("y: ", y)
z = x.difference(y)
z2 = y.difference(x)
print("z: ", z)
print("z2: ", z2)
print("Total amount of different numbers: ", len(z) + len(z2))
