# 7. Оглянемся назад. Числа
# Даны два натуральных числа.
# Вычислите их наибольший общий делитель при помощи алгоритма Евклида
# (мы не знаем функции и рекурсию).
# ------------------------------------------------------------------------------------ #

a = 10  # int(input("Please, enter 1st number: ", ))
b = 15  # int(input("Please, enter 2nd number: ",))
print("1st number: ", a)
print("2nd number: ", b)

while a != 0 and b != 0:
    if a > b:
        a = a % b
    else:
        b = b % a

print("GCF: ", a + b)
