# 4. Даны два списка чисел.
# Посчитайте, сколько различных чисел входит только
# в один из этих списков.

# ------------------------------------------------------------------------------------ #

a = {1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 1}  # input()
b = {1, 700, 900, 5, 7, 100, 150, 1000000, 700}  # input()
print("a: ", a)
print("b: ", b)
c = a.difference(b)
print("c: ", c)
print("Total amount of different numbers in 1 list: ", len(c))
