"""
Homework 5 - Task5
Написать программу которая находит ближайшую степень
двойки к введенному числу. 10(8), 20(16), 1(1), 13(16)
"""


x = int(input("Введите число: "))
y = x
val = 0

while x > 0:
    x = x >> 1
    val += 1

if 2 ** val - y < y - 2 ** (val - 1):
    print("{}({})".format(y, 2 ** val))
else:
    print("{}({})".format(y, 2 ** (val - 1)))
